brew "chezmoi"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "jq"
brew "lazygit"
brew "mas"
brew "mosh"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tree"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "speedtest-cli"
brew "helix"
brew "eza"
brew "rtk"
brew "git-delta"
brew "marksman"
brew "ltex-ls"
brew "golangci-lint"
brew "rust-analyzer"
brew "zls"
brew "taplo"

cask "1password"
cask "1password-cli"
cask "adguard"
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "rectangle"
cask "tailscale-app"
cask "vscodium"
cask "zed"
cask "betterdisplay"
cask "bettertouchtool"
cask "mac-mouse-fix"

mas "TextSniper", id: 1528890965
mas "Noir",       id: 1592917505
